# FabricationUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationUtils Class
Members See Also
---
General utility methods in the Autodesk Revit MEP product for fabrication.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static class FabricationUtils
```

Visual Basic
---
```text
Public NotInheritable Class FabricationUtils
```

Visual C++
---
```text
public ref class FabricationUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Fabrication..::..FabricationUtils
# See Also
FabricationUtils Members
Autodesk.Revit.DB.Fabrication Namespace